In [21]:
import numpy as np
import pandas as pd

In [22]:
df = pd.read_csv('student_dataset.csv')
print(df)

       Name Class  Subject  Marks   Age
0    Hannah     B  Science    NaN   NaN
1       Eve     B     Math  106.0   NaN
2       Eve     B  Science    NaN   NaN
3   Charlie     C  Science   19.0   NaN
4     Grace     C  Science    NaN  16.0
5   Charlie     B  Science    NaN  23.0
6     Grace     B  Science    NaN  17.0
7    Hannah     C  English    NaN   NaN
8     Frank     A  English   64.0   NaN
9       Eve     A  English  104.0  16.0
10    Alice     B  English    NaN  23.0
11    Frank     C     Math   52.0   NaN
12  Charlie     B  English   92.0   NaN
13    David     B     Math    NaN   NaN
14   Hannah     A  Science  104.0  21.0
15      Bob     B  English    NaN   NaN
16    Frank     B  English    NaN   NaN
17      Eve     B  English   27.0  23.0
18      Eve     A  Science    NaN   NaN
19      Eve     C  Science    NaN  22.0
20      NaN     B     Math   47.0   NaN
21      NaN     A     Math    NaN   NaN
22      Bob     A  English   39.0   NaN
23      Eve     B  Science   -3.0  20.0
24      Ivy     A  English   75.0   NaN
25  Charlie     C  English    NaN  18.0
26  Charlie     A     Math    NaN  25.0
27      Bob     A     Math   57.0   NaN
28      Eve     A     Math   77.0   NaN
29      Ivy     A     Math    NaN  16.0
30     Jack     B     Math   74.0  25.0
31     Jack     A  English   15.0  15.0
32      Bob     C  Science   53.0   NaN
33    Grace     C  Science    NaN  24.0
34     Jack     C     Math    NaN  19.0
35      NaN     A     Math   31.0  15.0
36      Eve     B     Math   60.0   NaN
37    Alice     A  English    NaN   NaN
38      NaN     C     Math    NaN   NaN
39  Charlie     C     Math    NaN   NaN
40      Ivy     A     Math   26.0   NaN
41    David     C     Math    NaN   NaN
42     Jack     B  English    NaN  15.0
43    Alice     C  Science    NaN   NaN
44      Ivy     B  English   50.0  24.0
45   Hannah     A  English   11.0  23.0
46    Grace     C  Science    NaN  21.0
47     Jack     C     Math    NaN   NaN
48      Eve     C  Science   33.0  25.0
49    Frank     B  English    NaN  18.0
50   Hannah     B  Science    NaN   NaN
51      Eve     B     Math  106.0   NaN
52      Eve     B  Science    NaN   NaN
53  Charlie     C  Science   19.0   NaN
54    Grace     C  Science    NaN  16.0

In [23]:
# print(df.isnull().sum())
print((df.isnull().mean()*100).round(2))

Name        7.27
Class       0.00
Subject     0.00
Marks      54.55
Age        56.36
dtype: float64

In [24]:
df["Name"].fillna("Unknown", inplace = True)

C:\Users\ujjaw\AppData\Local\Temp\ipykernel_6988\2653986269.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df["Name"].fillna("Unknown", inplace = True)

In [25]:
print((df.isnull().mean()*100).round(2))

Name        0.00
Class       0.00
Subject     0.00
Marks      54.55
Age        56.36
dtype: float64

In [26]:
df["Marks"] = df["Marks"].fillna(df["Marks"].mean())
df["Age"] = df["Age"].fillna(df["Age"].median())

# Dropna

In [27]:
print((df.isnull().mean()*100).round(2))

Name       0.0
Class      0.0
Subject    0.0
Marks      0.0
Age        0.0
dtype: float64

In [28]:
print(df)

       Name Class  Subject   Marks   Age
0    Hannah     B  Science   53.52  20.5
1       Eve     B     Math  106.00  20.5
2       Eve     B  Science   53.52  20.5
3   Charlie     C  Science   19.00  20.5
4     Grace     C  Science   53.52  16.0
5   Charlie     B  Science   53.52  23.0
6     Grace     B  Science   53.52  17.0
7    Hannah     C  English   53.52  20.5
8     Frank     A  English   64.00  20.5
9       Eve     A  English  104.00  16.0
10    Alice     B  English   53.52  23.0
11    Frank     C     Math   52.00  20.5
12  Charlie     B  English   92.00  20.5
13    David     B     Math   53.52  20.5
14   Hannah     A  Science  104.00  21.0
15      Bob     B  English   53.52  20.5
16    Frank     B  English   53.52  20.5
17      Eve     B  English   27.00  23.0
18      Eve     A  Science   53.52  20.5
19      Eve     C  Science   53.52  22.0
20  Unknown     B     Math   47.00  20.5
21  Unknown     A     Math   53.52  20.5
22      Bob     A  English   39.00  20.5
23      Eve     B  Science   -3.00  20.0
24      Ivy     A  English   75.00  20.5
25  Charlie     C  English   53.52  18.0
26  Charlie     A     Math   53.52  25.0
27      Bob     A     Math   57.00  20.5
28      Eve     A     Math   77.00  20.5
29      Ivy     A     Math   53.52  16.0
30     Jack     B     Math   74.00  25.0
31     Jack     A  English   15.00  15.0
32      Bob     C  Science   53.00  20.5
33    Grace     C  Science   53.52  24.0
34     Jack     C     Math   53.52  19.0
35  Unknown     A     Math   31.00  15.0
36      Eve     B     Math   60.00  20.5
37    Alice     A  English   53.52  20.5
38  Unknown     C     Math   53.52  20.5
39  Charlie     C     Math   53.52  20.5
40      Ivy     A     Math   26.00  20.5
41    David     C     Math   53.52  20.5
42     Jack     B  English   53.52  15.0
43    Alice     C  Science   53.52  20.5
44      Ivy     B  English   50.00  24.0
45   Hannah     A  English   11.00  23.0
46    Grace     C  Science   53.52  21.0
47     Jack     C     Math   53.52  20.5
48      Eve     C  Science   33.00  25.0
49    Frank     B  English   53.52  18.0
50   Hannah     B  Science   53.52  20.5
51      Eve     B     Math  106.00  20.5
52      Eve     B  Science   53.52  20.5
53  Charlie     C  Science   19.00  20.5
54    Grace     C  Science   53.52  16.0

In [29]:
df = df.drop_duplicates()
print(df)

       Name Class  Subject   Marks   Age
0    Hannah     B  Science   53.52  20.5
1       Eve     B     Math  106.00  20.5
2       Eve     B  Science   53.52  20.5
3   Charlie     C  Science   19.00  20.5
4     Grace     C  Science   53.52  16.0
5   Charlie     B  Science   53.52  23.0
6     Grace     B  Science   53.52  17.0
7    Hannah     C  English   53.52  20.5
8     Frank     A  English   64.00  20.5
9       Eve     A  English  104.00  16.0
10    Alice     B  English   53.52  23.0
11    Frank     C     Math   52.00  20.5
12  Charlie     B  English   92.00  20.5
13    David     B     Math   53.52  20.5
14   Hannah     A  Science  104.00  21.0
15      Bob     B  English   53.52  20.5
16    Frank     B  English   53.52  20.5
17      Eve     B  English   27.00  23.0
18      Eve     A  Science   53.52  20.5
19      Eve     C  Science   53.52  22.0
20  Unknown     B     Math   47.00  20.5
21  Unknown     A     Math   53.52  20.5
22      Bob     A  English   39.00  20.5
23      Eve     B  Science   -3.00  20.0
24      Ivy     A  English   75.00  20.5
25  Charlie     C  English   53.52  18.0
26  Charlie     A     Math   53.52  25.0
27      Bob     A     Math   57.00  20.5
28      Eve     A     Math   77.00  20.5
29      Ivy     A     Math   53.52  16.0
30     Jack     B     Math   74.00  25.0
31     Jack     A  English   15.00  15.0
32      Bob     C  Science   53.00  20.5
33    Grace     C  Science   53.52  24.0
34     Jack     C     Math   53.52  19.0
35  Unknown     A     Math   31.00  15.0
36      Eve     B     Math   60.00  20.5
37    Alice     A  English   53.52  20.5
38  Unknown     C     Math   53.52  20.5
39  Charlie     C     Math   53.52  20.5
40      Ivy     A     Math   26.00  20.5
41    David     C     Math   53.52  20.5
42     Jack     B  English   53.52  15.0
43    Alice     C  Science   53.52  20.5
44      Ivy     B  English   50.00  24.0
45   Hannah     A  English   11.00  23.0
46    Grace     C  Science   53.52  21.0
47     Jack     C     Math   53.52  20.5
48      Eve     C  Science   33.00  25.0
49    Frank     B  English   53.52  18.0

In [30]:
df = df[(df['Marks']>0) & (df['Marks']<100)]
df = df[(df['Age']>0) & (df['Age']<100)]
print(df)

       Name Class  Subject  Marks   Age
0    Hannah     B  Science  53.52  20.5
2       Eve     B  Science  53.52  20.5
3   Charlie     C  Science  19.00  20.5
4     Grace     C  Science  53.52  16.0
5   Charlie     B  Science  53.52  23.0
6     Grace     B  Science  53.52  17.0
7    Hannah     C  English  53.52  20.5
8     Frank     A  English  64.00  20.5
10    Alice     B  English  53.52  23.0
11    Frank     C     Math  52.00  20.5
12  Charlie     B  English  92.00  20.5
13    David     B     Math  53.52  20.5
15      Bob     B  English  53.52  20.5
16    Frank     B  English  53.52  20.5
17      Eve     B  English  27.00  23.0
18      Eve     A  Science  53.52  20.5
19      Eve     C  Science  53.52  22.0
20  Unknown     B     Math  47.00  20.5
21  Unknown     A     Math  53.52  20.5
22      Bob     A  English  39.00  20.5
24      Ivy     A  English  75.00  20.5
25  Charlie     C  English  53.52  18.0
26  Charlie     A     Math  53.52  25.0
27      Bob     A     Math  57.00  20.5
28      Eve     A     Math  77.00  20.5
29      Ivy     A     Math  53.52  16.0
30     Jack     B     Math  74.00  25.0
31     Jack     A  English  15.00  15.0
32      Bob     C  Science  53.00  20.5
33    Grace     C  Science  53.52  24.0
34     Jack     C     Math  53.52  19.0
35  Unknown     A     Math  31.00  15.0
36      Eve     B     Math  60.00  20.5
37    Alice     A  English  53.52  20.5
38  Unknown     C     Math  53.52  20.5
39  Charlie     C     Math  53.52  20.5
40      Ivy     A     Math  26.00  20.5
41    David     C     Math  53.52  20.5
42     Jack     B  English  53.52  15.0
43    Alice     C  Science  53.52  20.5
44      Ivy     B  English  50.00  24.0
45   Hannah     A  English  11.00  23.0
46    Grace     C  Science  53.52  21.0
47     Jack     C     Math  53.52  20.5
48      Eve     C  Science  33.00  25.0
49    Frank     B  English  53.52  18.0

In [31]:
# Column -> First Name
df.rename(columns={'Class': 'Section'}, inplace=True)

In [32]:
print(df)

       Name Section  Subject  Marks   Age
0    Hannah       B  Science  53.52  20.5
2       Eve       B  Science  53.52  20.5
3   Charlie       C  Science  19.00  20.5
4     Grace       C  Science  53.52  16.0
5   Charlie       B  Science  53.52  23.0
6     Grace       B  Science  53.52  17.0
7    Hannah       C  English  53.52  20.5
8     Frank       A  English  64.00  20.5
10    Alice       B  English  53.52  23.0
11    Frank       C     Math  52.00  20.5
12  Charlie       B  English  92.00  20.5
13    David       B     Math  53.52  20.5
15      Bob       B  English  53.52  20.5
16    Frank       B  English  53.52  20.5
17      Eve       B  English  27.00  23.0
18      Eve       A  Science  53.52  20.5
19      Eve       C  Science  53.52  22.0
20  Unknown       B     Math  47.00  20.5
21  Unknown       A     Math  53.52  20.5
22      Bob       A  English  39.00  20.5
24      Ivy       A  English  75.00  20.5
25  Charlie       C  English  53.52  18.0
26  Charlie       A     Math  53.52  25.0
27      Bob       A     Math  57.00  20.5
28      Eve       A     Math  77.00  20.5
29      Ivy       A     Math  53.52  16.0
30     Jack       B     Math  74.00  25.0
31     Jack       A  English  15.00  15.0
32      Bob       C  Science  53.00  20.5
33    Grace       C  Science  53.52  24.0
34     Jack       C     Math  53.52  19.0
35  Unknown       A     Math  31.00  15.0
36      Eve       B     Math  60.00  20.5
37    Alice       A  English  53.52  20.5
38  Unknown       C     Math  53.52  20.5
39  Charlie       C     Math  53.52  20.5
40      Ivy       A     Math  26.00  20.5
41    David       C     Math  53.52  20.5
42     Jack       B  English  53.52  15.0
43    Alice       C  Science  53.52  20.5
44      Ivy       B  English  50.00  24.0
45   Hannah       A  English  11.00  23.0
46    Grace       C  Science  53.52  21.0
47     Jack       C     Math  53.52  20.5
48      Eve       C  Science  33.00  25.0
49    Frank       B  English  53.52  18.0

In [33]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 46 entries, 0 to 49
Data columns (total 5 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Name     46 non-null     object
 1   Section  46 non-null     object
 2   Subject  46 non-null     object
 3   Marks    46 non-null     float64
 4   Age      46 non-null     float64
dtypes: float64(2), object(3)
memory usage: 2.2+ KB

In [36]:
df["Name"] = df["Name"].astype("string")
df["Section"] = df["Section"].astype("string")
df['Subject'] = df['Subject'].astype("string")
df["Age"] = df["Age"].astype("int")

In [37]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 46 entries, 0 to 49
Data columns (total 5 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Name     46 non-null     string
 1   Section  46 non-null     string
 2   Subject  46 non-null     string
 3   Marks    46 non-null     float64
 4   Age      46 non-null     int32
dtypes: float64(1), int32(1), string(3)
memory usage: 2.0 KB

In [38]:
# Saving

df.to_csv("cleaned_dataset.csv", index = False)